app/controllers/searches_controller.rb

INSERT INTO "searches" ("created_at", "domain_name", "search_text", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 06 Jun 2012 12:19:37 UTC +00:00], ["domain_name", "google.in"], ["search_text", "google"], ["updated_at", Wed, 06 Jun 2012 12:19:37 UTC +00:00]]
SELECT "searches".* FROM "searches" WHERE "searches"."domain_name" = 'google.in'
---
  def find_domain_name
    @country_codes = %w[.com .in .net .co.in .org]
    @domain = params[:search_text]
    @domain_names = []
    @flag = []
    @country_codes.each do |cc|
      @cc = cc
      @domain_names << "#{@domain + @cc}"
      if(Search.where(domain_name: "#{@domain + @cc}").length > 0) #checks whether domain exists in database or not